Repository: 2448986301/AggieGPA
Catalog: AggieGPA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Current grades use course work. Final grades replace estimates when the final report arrives.
zh_hans: 当前成绩来自课程作业；最终成绩单到达后，最终成绩会替代当前和预计值。

source: Current is where you are; Projected is where you may finish
zh_hans: 当前是你现在的状态；预计是你可能完成的结果

source: Current percentage
zh_hans: 当前百分比

source: Current Quarter
zh_hans: 当前学期

# Current quarter %@, cumulative %@
source: Current quarter %1$@, cumulative %2$@
zh_hans: 当前学期 %@，累计 %@

source: Current term
zh_hans: 当前学期

source: Current Version
zh_hans: 当前版本

source: Current Week
zh_hans: 本周

source: Current, projected, and target
zh_hans: 当前、预计和目标

source: Custom
zh_hans: 自定义

source: Custom / manual review
zh_hans: 自定义／人工核对

source: Custom display name (optional)
zh_hans: 自定义显示名称（可选）

source: Danger Zone
zh_hans: 危险操作

source: Dark
zh_hans: 深色

source: Data
zh_hans: 数据

source: Data & Backups
zh_hans: 数据与备份

source: Data access
zh_hans: 数据访问权限

source: Date
zh_hans: 日期

source: Days between items
zh_hans: 项目间隔天数

source: Deadline density
zh_hans: 截止日期密度

source: Deadlines
zh_hans: 截止事项

source: Default
zh_hans: 默认

source: Default grading basis
zh_hans: 默认评分方式

source: Default, Dark, Clear, Tinted, and Monochrome appearances are selected by the iOS Home Screen. Aggie GPA does not pretend to switch unsupported system icon modes at runtime.
zh_hans: 默认、深色、透明、着色和单色图标由 iOS 主屏幕选择。Aggie GPA 不会伪装支持系统未提供的运行时图标模式切换。

source: Defaults
zh_hans: 默认设置

source: Delete
zh_hans: 删除

source: Delete Assignment
zh_hans: 删除作业

source: Delete Category
zh_hans: 删除分类

source: Delete Course
zh_hans: 删除课程

source: Delete Quarter
zh_hans: 删除学期

source: Delete Template
zh_hans: 删除模板

source: Delete this assignment?
zh_hans: 要删除这项作业吗？

source: Delete this category?
zh_hans: 要删除这个分类吗？

source: Delete this course?
zh_hans: 要删除这门课吗？

source: Delete this graded assignment?
zh_hans: 要删除这项已评分作业吗？

source: Delete this quarter and all of its courses?
zh_hans: 删除这个学期及其中的全部课程？

source: Delete this template?
zh_hans: 删除此模板？

source: Detailed course-grade tracking and safer planning tools.
zh_hans: 更详细的课程成绩记录与更安全的规划工具。

source: Details
zh_hans: 详细信息

source: Device Performance
zh_hans: 设备性能

source: Discard
zh_hans: 丢弃

source: Disclaimer
zh_hans: 免责声明

source: Disclaimer details
zh_hans: 非官方学生工具，与 UC Davis 无隶属关系。 Aggie GPA 无法决定正式学业状态、毕业资格、重复课程注记、转学分认定、专业要求或 Registrar 的最终决定。政策可能变化，各学院或项目也可能有额外规则。

source: Dismiss score impact
zh_hans: 关闭成绩影响提示

source: Display
zh_hans: 显示

source: Distance to target
zh_hans: 距离目标

source: Done
zh_hans: 完成

source: Download %@ to analyze syllabi on this device.
zh_hans: 下载 %@，即可在这台设备上分析课程大纲。

source: Download a model and choose it below. The app remains fully usable without one.
zh_hans: 下载模型后在下方选择。即使没有模型，应用的核心功能仍可正常使用。

source: Download Local Model
zh_hans: 下载本地模型

source: Download progress
zh_hans: 下载进度

source: Download Progress
zh_hans: 下载进度

source: Download Size
zh_hans: 下载大小

source: Download the 491 MB local model to analyze syllabi on this device.
zh_hans: 下载 491 MB 的本地模型，即可在这台设备上分析课程大纲。

source: Download, switch, or remove local models. Models stay on this device and are never required for the core gradebook.
zh_hans: 下载、切换或移除本地模型。模型只保留在这台设备上，核心成绩簿不依赖模型。

source: Downloaded
zh_hans: 已下载

source: Downloading
zh_hans: 下载中

source: Downloading the local model
zh_hans: 正在下载本地模型

source: Draft
zh_hans: 草稿

source: Draft ${titleText} for ${course} due ${dueDate}
zh_hans: 为 ${course} 创建 ${titleText} 草稿，到期日 ${dueDate}

source: Drop lowest: %lld
zh_hans: 去除最低分：%lld

source: Dropped
zh_hans: 已舍弃

source: Due
zh_hans: 截止时间

source: Due %@ · %@ is worth %@ of the course grade.
zh_hans: %@到期 · %@ 占课程总评的 %@。

source: Due %@; earned points are empty.
zh_hans: 截止时间为 %@；尚未记录所得分数。

source: Due %@.
zh_hans: %@到期。

source: Due date
zh_hans: 截止日期

source: Due Date
zh_hans: 截止日期

source: Due in the next seven days
zh_hans: 未来七天到期

source: Due Today
zh_hans: 今天到期

source: Duplicate
zh_hans: 复制

source: Duplicate grading categories were combined for review.
zh_hans: 重复的评分类别已合并，等待你确认。

source: Earned
zh_hans: 已得分

source: Earned points
zh_hans: 已得分

source: Earned Points
zh_hans: 已得分

source: Earned points (optional)
zh_hans: 已得分（可选）

source: Easier first-term and course-grade setup
zh_hans: 更容易设置首个学期和课程成绩

source: Edit
zh_hans: 编辑

source: Edit Assignment Details
zh_hans: 编辑作业信息

source: Edit Category
zh_hans: 编辑类别

source: Edit Course
zh_hans: 编辑课程

source: Edit extracted details
zh_hans: 编辑识别出的细节

source: Edit Grade Item
zh_hans: 编辑作业或考试

source: Edit Reminder
zh_hans: 编辑提醒

source: Edit Score
zh_hans: 编辑成绩

source: Edit Semester Dates
zh_hans: 编辑学期日期

source: Edit Term
zh_hans: 编辑学期

source: Enable Siri Access
zh_hans: 启用 Siri 访问

source: End Date
zh_hans: 结束日期

source: Ended
zh_hans: 结束

source: English and Simplified Chinese are supported. The app uses a local model when available and otherwise shows a deterministic manual fallback.
zh_hans: 支持英语和简体中文。有可用模型时使用本地模型，否则使用确定性的手动回退。

source: Enter a prefix and positive points to preview the items.
zh_hans: 输入名称前缀和大于 0 的满分后即可预览项目。

source: Enter GPA values from 0 to 4 and future units greater than 0 to see your target.
zh_hans: 输入 0 到 4 的 GPA，并将未来学分设为大于 0，即可查看目标。

source: Enter non-negative points and weights from 0 to 100.
zh_hans: 请输入非负分数，以及 0 到 100 的权重。

source: Enter valid GPA values from 0 to 4 and future units greater than 0.
zh_hans: 请输入 0 到 4 的有效 GPA，且未来学分须大于 0。

source: Equal items
zh_hans: 各项目等权

source: Estimate
zh_hans: 估算

source: Estimated
zh_hans: 预计

source: Estimated influence: category weight and item points produce about %@ of course weight.
zh_hans: 预计影响：类别权重和项目分值约占课程总评 %@。

source: Estimated only. Verify with your official transcript or academic advisor.
zh_hans: 仅为估算，请以正式成绩单或学业顾问的意见为准。

source: Estimated overall
zh_hans: 累计预计

source: Estimated quarter
zh_hans: 预计学期

source: Estimated results
zh_hans: 预计成绩

source: Estimated term
zh_hans: 本学期预计

source: Estimated term GPA
zh_hans: 预计学期 GPA

source: Estimates never change your official GPA.
zh_hans: 预计成绩不会修改正式 GPA。

source: Exam
zh_hans: 考试

source: Exam date
zh_hans: 考试日期

source: Exam Draft
zh_hans: 考试草稿

source: Exam name
zh_hans: 考试名称

source: Exam Name
zh_hans: 考试名称

source: exams
zh_hans: 场考试

source: Exams
zh_hans: 考试

source: Exclude until graded
zh_hans: 评分前不计入

source: Excluded
zh_hans: 已排除

source: Excused
zh_hans: 免除

source: Existing grades are kept
zh_hans: 已有成绩会保留

source: Existing matching courses will receive the simulated grades. New planned courses will be added to the most recent quarter.
zh_hans: 匹配的现有课程将使用模拟成绩，新规划课程会添加到最近的学期。

source: Expected
zh_hans: 按当前表现

source: Expected GPA
zh_hans: 预计 GPA

source: Expected grade
zh_hans: 预计成绩

source: Expected Scenario
zh_hans: 常规方案

source: Expected units
zh_hans: 预计学分

source: Explore
zh_hans: 探索

source: Explore changes without altering official grades
zh_hans: 模拟变化，不修改正式成绩

source: Explore Goal
zh_hans: 推演目标

source: Explore grade momentum with clearer feedback and more fluid interactions.
zh_hans: 用更清楚的反馈和更流畅的交互掌握成绩变化。

source: Export
zh_hans: 导出

source: Export CSV
zh_hans: 导出 CSV

source: Export JSON Backup
zh_hans: 导出 JSON 备份

source: Extra credit
zh_hans: 额外加分

source: Extra-credit category
zh_hans: 额外加分类别

source: Extract Rules
zh_hans: 提取规则

source: Extracted grading information
zh_hans: 识别出的评分信息

source: Fall
zh_hans: 秋季

source: Final
zh_hans: 最终

source: Final %@
zh_hans: 最终 %@

source: Final Exam
zh_hans: 期末考试

source: Final exam weight
zh_hans: 期末考试权重

source: Final GPA
zh_hans: 最终 GPA

source: Final GPA %@
zh_hans: 最终 GPA %@

source: Final GPA: %@
zh_hans: 最终 GPA：%@

source: Final Grade
zh_hans: 最终成绩

source: Final grade · Not recorded
zh_hans: 最终成绩 · 未录入

source: Final grade replaces this course's Current and Projected values.
zh_hans: 最终成绩会替代这门课的当前和预计成绩。

source: Final Grade: %@
zh_hans: 最终成绩：%@

source: Final grades %lld of %lld available
zh_hans: 最终成绩已收到 %1$lld/%2$lld 门

source: Final recorded grade: %@
zh_hans: 正式记录成绩：%@

source: Final Report grade
zh_hans: 最终成绩单成绩

source: Final report pending
zh_hans: 最终成绩未录入

source: Final score needed
zh_hans: 期末所需分数

source: Final Score Needed
zh_hans: 期末所需分数

source: Finals goal
zh_hans: 期末目标

source: Finals Goal
zh_hans: 期末目标

source: Find the future average you need
zh_hans: 计算未来需要达到的平均成绩

source: Fine-tune assignments
zh_hans: 逐项调整

source: First academic year
zh_hans: 首个学年

source: First due date
zh_hans: 首个截止日期

source: First token
zh_hans: 首次响应

source: Focus Next
zh_hans: 下一步建议

source: Focus Now
zh_hans: 现在最值得关注

source: For example: Chemistry, Chem 2A, 化学
zh_hans: 例如：化学、Chem 2A、CHE 002A

source: Forecast cumulative
zh_hans: 预测累计 GPA

source: Forecast Scenario
zh_hans: 预测方案

source: Forecast this term
zh_hans: 本学期预测

source: Forecast uses selected course estimates only. Official GPA remains unchanged.
zh_hans: 预测只使用已选择的课程估计；正式 GPA 不会改变。

source: Forecasts, targets, syllabus import, and local reminders
zh_hans: 成绩预测、目标、课程大纲导入和本地提醒

source: Formula and assumptions
zh_hans: 公式与假设

source: Foundation Models is unavailable on this system.
zh_hans: 此设备无法使用基础模型。

source: Full analysis
zh_hans: 完整分析

source: Full Simulation
zh_hans: 完整模拟

source: Future Quarter
zh_hans: 未来学期

source: Future terms
zh_hans: 未来学期

source: Generation speed
zh_hans: 生成速度

source: Get Attention Items
zh_hans: 获取待处理项目

source: Get Course Grade
zh_hans: 获取课程成绩

source: Get GPA Overview
zh_hans: 获取 GPA 概览

source: Get official GPA for ${term}
zh_hans: 获取 ${term} 的正式 GPA

source: Get Projected GPA
zh_hans: 查询预测 GPA

source: Get projected GPA${term}
zh_hans: 查询预测 GPA${term}

source: Get Quarter GPA
zh_hans: 获取学期 GPA

source: Get Started
zh_hans: 开始使用

source: Get the grade for ${course}
zh_hans: 获取 ${course} 的成绩

source: Get Upcoming Assignments
zh_hans: 查询近期作业

source: Get Upcoming Exams
zh_hans: 查询近期考试

source: Goal
zh_hans: 目标

source: Goal estimate unavailable
zh_hans: 无法估算目标

source: GPA decimal places
zh_hans: GPA 小数位数

source: GPA Demo
zh_hans: GPA 示例

source: GPA impact
zh_hans: GPA 影响

source: GPA Journey
zh_hans: GPA 变化

source: GPA journey chart
zh_hans: GPA 变化图

source: GPA journey summary: Current %@, projected %@, target %@.
zh_hans: GPA 变化概览：当前 %@，预计 %@，目标 %@。

source: GPA overview
zh_hans: GPA 概览

source: GPA Overview
zh_hans: GPA 概览

source: GPA Rules
zh_hans: GPA 规则

source: GPA rules details
zh_hans: 字母成绩采用 UC Davis 成绩点：A+ 与 A 均为 4.0；除 A+ 外，加减等级相差 0.3。P、NP、S、U、I、IP 和 NG 默认不计入 GPA 估算。 本科重复修读替换按最多 16 学分估算。若某门重复课程会部分超过上限，本工具会把两次成绩都纳入估算。复杂情况会标记为需要人工核对。 所有结果均为估算，请始终核对正式成绩单或咨询学业顾问。

source: GPA Summary
zh_hans: GPA 摘要

source: GPA Trend
zh_hans: GPA 趋势

source: GPA trend data: %@
zh_hans: GPA 趋势数据：%@

source: Grade
zh_hans: 成绩

source: Grade Breakdown
zh_hans: 成绩构成

source: Grade Item
zh_hans: 作业或考试

source: Grade item deleted
zh_hans: 已删除作业或考试

source: Grade Scale
zh_hans: 成绩等级

source: Grade scale is incomplete
zh_hans: 等级分数表不完整

source: Grade Scenario
zh_hans: 成绩方案

source: Grade-point estimates
zh_hans: 成绩点估算

source: Gradebook
zh_hans: 成绩册

source: Graded
zh_hans: 已评分

source: Graded so far
zh_hans: 已完成评分

source: Grades & GPA
zh_hans: 成绩与 GPA

source: Grading basis
zh_hans: 评分方式

source: Grading Categories
zh_hans: 评分类别

source: Grading categories not found
zh_hans: 未找到评分类别

source: Grading method
zh_hans: 评分方式

source: Grading method is not set
zh_hans: 尚未设置评分方式

source: Grading method needs confirmation
zh_hans: 评分方式需要确认

source: Grading Policy
zh_hans: 评分规则

source: Grading policy checked
zh_hans: 评分规则已核对

source: Grading Rules
zh_hans: 评分规则

source: Grading rules need confirmation
zh_hans: 评分规则需要确认

source: Handling
zh_hans: 处理方式

source: Haptics
zh_hans: 触觉反馈

source: Has due date
zh_hans: 设置截止时间

source: Heavy
zh_hans: 较重

source: Hide assignment details
zh_hans: 收起作业细节

source: Hide Details
zh_hans: 收起详情

source: Hide Focus Next
zh_hans: 隐藏下一步建议

source: Hide saved plans
zh_hans: 收起已保存方案

source: High Impact
zh_hans: 高影响

source: High School Credit
zh_hans: 高中学分

source: Highest possible final GPA
zh_hans: 最高可能最终 GPA

source: Highlights
zh_hans: 主要更新

source: Hold to Speak
zh_hans: 按住说话

source: Homework
zh_hans: 作业

source: Homework / Quizzes / Midterms / Final
zh_hans: 作业 / 小测 / 期中 / 期末

source: Homework 1–10
zh_hans: 作业 1–10

source: Hot
zh_hans: 较热

source: How is this course graded?
zh_hans: 这门课是如何计分的？

source: Hybrid
zh_hans: 混合方式

source: I confirm missing items should count as zero
zh_hans: 我确认缺交任务应按零分计

source: I confirm this scale matches the course
zh_hans: 我确认此成绩等级表与课程规则一致

source: I want to finish with
zh_hans: 我的目标成绩

source: Immediately
zh_hans: 立即

source: Impact and opportunity
zh_hans: 影响与提升机会

source: Import
zh_hans: 导入

source: Import a syllabus, choose a template, or set it up manually.
zh_hans: 导入课程大纲、选择模板，或手动设置。

source: Import backup
zh_hans: 导入备份

source: Import failed
zh_hans: 导入失败

source: Import GGUF from Files
zh_hans: 从“文件”导入本地模型

source: Import Grading Policy
zh_hans: 导入评分规则

source: Import JSON Backup
zh_hans: 导入 JSON 备份

source: Import once, then ask questions about this course's saved syllabus anytime.
zh_hans: 导入一次后，随时都可以询问本课程已保存的大纲。

source: Import or review the grading policy extracted from a syllabus. The original syllabus is not stored here.
zh_hans: 导入或查看从课程大纲中提取的评分规则。这里不会保存课程大纲原文。

source: Import Syllabus
zh_hans: 导入课程大纲

source: Import, Export & Backups
zh_hans: 导入、导出与备份

source: Improved assignment editing, deletion, and undo.
zh_hans: 优化作业编辑、删除和撤销体验。

source: Improved English and Simplified Chinese syllabus-import guidance
zh_hans: 改进英语和简体中文的课程大纲导入指引

source: Improved English, Simplified Chinese, and accessibility support
zh_hans: 改进英文、简体中文和无障碍支持

source: Improved English, Simplified Chinese, Dynamic Type, and Reduce Motion support
zh_hans: 改进英文、简体中文、动态字体和减弱动态效果支持

source: Improved local backup, restore, and data export.
zh_hans: 改进本地备份、恢复和数据导出。

source: Include
zh_hans: 纳入计算

source: Include %@
zh_hans: 纳入 %@

source: Include all eligible courses
zh_hans: 包含所有符合条件的课程

source: Include in cumulative GPA
zh_hans: 计入累计 GPA

source: Include in GPA estimate
zh_hans: 计入 GPA 估算

source: Included
zh_hans: 已计入

source: Independent student tool
zh_hans: 独立学生工具

source: Information
zh_hans: 提示信息

source: Inputs
zh_hans: 输入

source: Insight Details
zh_hans: 提示详情

source: Institution
zh_hans: 学校或机构

source: Interactive grade simulations stay separate from recorded scores
zh_hans: 交互式成绩试算不会改动已记录分数

source: iOS will ask for notification permission when you save an enabled reminder.
zh_hans: 保存已启用的提醒时，iOS 会请求通知权限。

source: Item calculation
zh_hans: 项目计算方式

source: Items
zh_hans: 项目

source: Items created
zh_hans: 项目已创建

source: Keep planned courses separate
zh_hans: 规划课程与正式记录分开

source: Keep recording actual scores and review the calculation when new work is added.
zh_hans: 继续记录实际成绩，并在新增作业后检查计算结果。

source: Keep records current
zh_hans: 及时核对正式记录

source: Lab
zh_hans: 实验

source: Lab 1–10
zh_hans: 实验 1–10

source: Labs
zh_hans: 实验

source: Language
zh_hans: 语言

source: Last Siri execution
zh_hans: 上次 Siri 运行记录

source: Last Used
zh_hans: 上次使用

source: Lead time
zh_hans: 提前时间

source: Letter Grade
zh_hans: 字母成绩

source: Letter Prediction
zh_hans: 字母成绩预测

source: Letter unavailable
zh_hans: 暂无字母等级

source: Light
zh_hans: 浅色

source: Light load
zh_hans: 轻负荷

source: Listening
zh_hans: 正在聆听

source: Lists assignments due in the next seven calendar days when allowed in Aggie GPA Settings.
zh_hans: 在 Aggie GPA 设置允许时，列出未来七个日历日内到期的作业。

source: Live outcome
zh_hans: 预计结果

source: Load
zh_hans: 负荷

source: Load clearly labeled demo data
zh_hans: 载入明确标注的演示数据

source: Load Demo Data
zh_hans: 载入演示数据

source: Loading the local model
zh_hans: 正在加载本地模型

source: Local backup, privacy lock, and bilingual support
zh_hans: 本地备份、隐私锁与双语支持

source: Local Explanation
zh_hans: 大纲依据

source: Local inference runtime
zh_hans: 本地推理运行时

source: Local language model
zh_hans: 本地语言模型

source: Local Rule Recognition
zh_hans: 本地规则识别

source: Local rule recognition created this review-only draft without using a language model.
zh_hans: 本地规则识别未使用语言模型，并生成了一份需要核对的草稿。

source: Local snapshots
zh_hans: 本地快照

source: Lock delay
zh_hans: 锁定延迟

source: Low Power Mode and serious thermal state can temporarily use a smaller downloaded model. Aggie GPA always tells you when that happens.
zh_hans: 低电量模式或较高温度可能会暂时使用较小的已下载模型。Aggie GPA 会明确提示你。

source: Major
zh_hans: 专业

source: Major course
zh_hans: 专业课程

source: Major GPA
zh_hans: 专业 GPA

source: Make it yours
zh_hans: 按你的需要设置

source: Manual access remains available
zh_hans: 仍可使用手动录入

source: Manual fallback
zh_hans: 手动回退

source: Manual Letter Grade
zh_hans: 仅手动录入字母成绩

source: Manual letter only
zh_hans: 仅手动字母成绩

source: Manual review required
zh_hans: 需要人工核对

source: Manual Review Required
zh_hans: 需要人工核对

source: Mark Complete
zh_hans: 标记为完成

source: Mark Excused
zh_hans: 标记为豁免

source: Mark Missing
zh_hans: 标记为缺交

source: Mark Submitted
zh_hans: 标记为已提交

source: Maximum future GPA is assumed to be 4.0. No intermediate value is rounded. Grade combinations are examples, not unique answers.
zh_hans: 假设未来最高 GPA 为 4.0；中间结果不舍入；成绩组合仅为示例，并非唯一答案。

source: Merge
zh_hans: 合并

source: Method
zh_hans: 方式

source: Microphone capture is not enabled here. Paste or type the transcript below to review the same local parser and confirmation flow.
zh_hans: 此版本未启用麦克风。请在下方粘贴或输入转写内容，检查同一套本地解析和确认流程。

source: Midterm
zh_hans: 期中

source: Midterm 1–3
zh_hans: 期中考试 1–3

source: Midterms
zh_hans: 期中

source: Missing
zh_hans: 缺交

source: Missing score
zh_hans: 分数缺失

source: Mixed Grading
zh_hans: 混合评分

source: Model
zh_hans: 模型

source: Model Budget
zh_hans: 模型预算

source: Model download
zh_hans: 模型下载

source: Model Library
zh_hans: 模型库

source: Model load
zh_hans: 模型加载

source: Models are stored outside the app bundle and excluded from device backups. Removing a model never removes course data.
zh_hans: 模型存储在应用包之外，并排除在设备备份之外。移除模型不会删除课程数据。

source: Moderate
zh_hans: 中等

source: More consistent motion, undo feedback, and iPhone and iPad layouts
zh_hans: 统一动画与撤销反馈，并改进 iPhone 和 iPad 布局

source: More Options
zh_hans: 更多选项

source: More than one replacement-exam rule was found. Confirm which rule applies.
zh_hans: 识别到多条考试替代规则，请确认实际采用哪一条。

source: Most Recent Attempt
zh_hans: 最近一次修读

source: Multiple grade items match this title. Open the course and choose one manually.
zh_hans: 有多个作业或考试使用这个名称，请打开课程后手动选择。

source: My Courses
zh_hans: 我的课程

source: My GPA plan
zh_hans: 我的 GPA 计划

source: Name
zh_hans: 名称

source: Name or nickname
zh_hans: 姓名或昵称

source: Name or nickname (optional)
zh_hans: 姓名或昵称（可选）

source: Name prefix
zh_hans: 名称前缀

source: Native iPad sidebar and course list-detail workspace
zh_hans: 新增原生 iPad 侧边栏和课程列表-详情工作区

source: Natural Language Quick Add
zh_hans: 自然语言快速添加

source: Need %@, but only %@ is available for local models.
zh_hans: 本地模型需要 %@，但目前只有 %@ 可用。

source: need attention
zh_hans: 项需要关注

source: Need more grade data
zh_hans: 需要更多成绩数据

source: Needs Attention
zh_hans: 需要处理

source: Needs review
zh_hans: 需要确认

source: Needs Review
zh_hans: 需要确认

source: Needs Your Review
zh_hans: 需要你确认

source: New Category
zh_hans: 新建类别

source: New Course
zh_hans: 新建课程

source: New Grade Item
zh_hans: 新建作业或考试

source: New Quarter
zh_hans: 新建学期

source: Next Month
zh_hans: 下个月

source: Next up
zh_hans: 下一项任务

source: Next, due today, high impact, and needs attention.
zh_hans: 下一步、今天到期、高影响和需要处理的事项。

source: No academic insights yet
zh_hans: 暂时没有学业提示

source: No account, no ads, no server, and no tracking.
zh_hans: 无需账号、没有广告、不用服务器，也不进行追踪。

source: No assessments on this day.
zh_hans: 这一天没有评估事项。

source: No assignments are due in the next seven days.
zh_hans: 未来七天没有到期的作业。

source: No assignments or exams
zh_hans: 暂无作业或考试

source: No assignments or exams yet
zh_hans: 还没有作业或考试

source: No automatic snapshots yet
zh_hans: 还没有自动快照

source: No breakdown yet
zh_hans: 暂无明细

source: No categories saved
zh_hans: 尚未保存评分类别

source: No confirmed course grade scale; letter prediction is hidden.
zh_hans: 尚未确认课程等级标准，因此暂不显示字母成绩预测。

source: No counted grade items yet.
zh_hans: 目前还没有计入成绩的项目。

source: No course grading policy is saved.
zh_hans: 尚未保存课程评分规则。

source: No course templates
zh_hans: 暂无课程模板

source: No courses
zh_hans: 暂无课程

source: No courses yet
zh_hans: 还没有课程

source: No current letter-graded courses are waiting for a grade.
zh_hans: 当前没有等待出分的字母成绩课程。

source: No current term
zh_hans: 暂无当前学期

source: No dated work
zh_hans: 本周没有安排

source: No deterministic alerts from the saved course data.
zh_hans: 根据已保存课程数据，没有确定性规则产生提示。

source: No estimate yet. Add one from a course.
zh_hans: 还没有预计成绩。可在课程中添加。

source: No explicit grading categories were found.
zh_hans: 未识别到明确的评分分类。

source: No forecast
zh_hans: 尚无预测

source: No GPA-eligible courses are in this plan.
zh_hans: 此计划中没有计入 GPA 的课程。

source: No letter
zh_hans: 无字母等级

source: No letter prediction
zh_hans: 暂不显示字母成绩预测

source: No matching quarters
zh_hans: 没有符合条件的学期

source: No matching syllabus policy was found.
zh_hans: 未找到匹配的课程大纲政策。

source: No model selected
zh_hans: 未选择模型

source: No pending letter-graded courses are available for assumptions.
zh_hans: 没有可供假设的待定字母成绩课程。

source: No quarters yet
zh_hans: 还没有学期

source: No readable text or image pages were found.
zh_hans: 没有找到可分析的文字或图片页面。

source: No reliable opportunity yet
zh_hans: 暂时还无法判断提升机会

source: No remaining work
zh_hans: 没有待评分项目

source: No saved plans
zh_hans: 没有已保存的计划

source: No saved scenarios
zh_hans: 还没有保存的方案

source: No scores
zh_hans: 暂无分数

source: No semester yet
zh_hans: 还没有学期

source: Non-UC coursework, AP/IB, and most transfer work normally do not enter the UC GPA. Keep this enabled only for personal planning.
zh_hans: 非 UC 课程、AP/IB 及大多数转学课程通常不计入 UC GPA。仅在个人规划需要时开启。

source: None
zh_hans: 无

source: Normal
zh_hans: 正常

source: Normalize current grade over graded work
zh_hans: 按已评分任务归一化当前成绩

source: Not Counted
zh_hans: 不计入

source: Not Downloaded
zh_hans: 未下载

source: Not enough graded work yet
zh_hans: 已评分工作还不够

source: Not found
zh_hans: 未识别到

source: Not graded yet
zh_hans: 尚未评分

source: Not imported
zh_hans: 尚未导入

source: Not included in GPA
zh_hans: 未计入 GPA

source: Not reachable with the planned units
zh_hans: 按计划学分无法达到

source: Not set
zh_hans: 未设置

source: Notes
zh_hans: 备注

source: Nothing changes course data until you choose Confirm Import
zh_hans: 在你选择“确认导入”前，课程数据不会被修改

source: Nothing due
zh_hans: 暂无待办

source: Nothing has been written yet. Review this summary, then confirm or discard the draft.
zh_hans: 尚未写入任何内容。请检查摘要后确认或丢弃草稿。

source: Nothing is saved until you confirm in Quick Add.
zh_hans: 在快速添加中确认前，不会保存任何内容。

source: Nothing is saved until you tap Confirm & Add.
zh_hans: 点击“确认并添加”前，不会保存任何内容。

source: Nothing is saved until you tap Create Items.
zh_hans: 点击“创建项目”后才会保存。

source: Nothing is written to this course until you choose Confirm & Import.
zh_hans: 在你点击“确认并导入”前，不会写入任何课程数据。

source: Nothing is written to this course until you choose Confirm Import.
zh_hans: 在你选择“确认导入”前，不会向这门课程写入任何数据。

source: Notifications
zh_hans: 通知

source: Number of items
zh_hans: 项目数量

source: Official %@
zh_hans: 正式成绩 %@

source: Official cumulative
zh_hans: 正式累计 GPA

source: Official GPA
zh_hans: 正式 GPA

source: Official recorded grade: %@
zh_hans: 正式记录成绩：%@

source: Official results
zh_hans: 正式成绩

source: Offline backup from Aggie GPA
zh_hans: 来自 Aggie GPA 的离线备份

source: OK
zh_hans: 好

source: On-device AI reads syllabus text and scanned pages without OCR
zh_hans: 设备端 AI 理解课程大纲文本和扫描页面，不依赖 OCR

source: On-Device Analysis
zh_hans: 设备端分析

source: On-Device Intelligence
zh_hans: 端侧智能

source: On-device local model
zh_hans: 设备端本地模型

source: Only the grading structure and scale are saved. Course grades, assignments, exams, and private notes are not copied.
zh_hans: 只保存评分结构和等级分数表，不会复制课程成绩、作业、考试或私人备注。

source: Only the inputs are saved; results recalculate from your current course data
zh_hans: 只保存计划输入；结果会根据当前课程数据重新计算

source: Open %@
zh_hans: 打开 %@

source: Open a course template
zh_hans: 打开课程模板

source: Open App Settings
zh_hans: 打开 App 设置
